In [41]:
import pandas as pd
import numpy as np
from pprint import pprint

from PIL.ImageChops import constant

In [42]:
data = {
    'Age': [25, np.nan, 22, 35, np.nan, 45],
    'Salary': [50000, 60000, np.nan, 80000, 75000, np.nan],
    'Gender': ['Male', 'Female', np.nan, 'Female', 'Male', 'Female'],
    'City': ['New York', np.nan, 'Los Angeles', 'Chicago', 'New York', np.nan],
}

pprint(data)

{'Age': [25, nan, 22, 35, nan, 45],
 'City': ['New York', nan, 'Los Angeles', 'Chicago', 'New York', nan],
 'Gender': ['Male', 'Female', nan, 'Female', 'Male', 'Female'],
 'Salary': [50000, 60000, nan, 80000, 75000, nan]}

In [43]:
df = pd.DataFrame(data)
df

    Age   Salary  Gender         City
0  25.0  50000.0    Male     New York
1   NaN  60000.0  Female          NaN
2  22.0      NaN     NaN  Los Angeles
3  35.0  80000.0  Female      Chicago
4   NaN  75000.0    Male     New York
5  45.0      NaN  Female          NaN

In [44]:
from sklearn.impute import SimpleImputer

In [45]:
mean= SimpleImputer(strategy='mean')

In [46]:
md = SimpleImputer( strategy='median')

In [47]:
mode = SimpleImputer( strategy='most_frequent')

In [48]:
const = SimpleImputer( strategy='constant', fill_value='city missing')

In [49]:
df['imputed_age'] = mean.fit_transform(df[['Age']])

In [50]:
df['imputed_salary'] = md.fit_transform(df[['Salary']])

In [56]:
imputed_gender = mode.fit_transform(df[['Gender']])
df['imputed_gender']=imputed_gender.ravel()

In [57]:
imputed_city = const.fit_transform(df[['City']])
df['imputed_city']=imputed_city.ravel()

In [58]:
df

,Age,Salary,Gender,City,imputed_age,imputed_salary,imputed_gender,imputed_city
0,25.0,50000.0,Male,New York,25.00,50000.0,Male,New York
1,NaN,60000.0,Female,NaN,31.75,60000.0,Female,city missing
2,22.0,NaN,NaN,Los Angeles,22.00,67500.0,Female,Los Angeles
3,35.0,80000.0,Female,Chicago,35.00,80000.0,Female,Chicago
4,NaN,75000.0,Male,New York,31.75,75000.0,Male,New York
5,45.0,NaN,Female,NaN,45.00,67500.0,Female,city missing